#1
x = int (1000)
y = int (2)
n = int (30)
a = int (3)
t1 = x - n * y + n * a
t2 = x - n * y
print ("Останется", t1, "ботов, если Вася будет их добавлять.", t2, " - если не будет.")
#2
x = float (3)
y = float (4)
a = float (1.5)
b = (x**2 + y**2)**0.5
l = b + 2 * a
print ("Георгию необходимо", l, "метров верёвки")
#3
import math
s1=7*9
s2=math.pi*((9/2)**2)
s3=8*9-2*3
print(max(s1,s2,s3))
#4
v1 = float (4)
v2 = float (30)
t1 = float (2)
t2 = float (10)
S = (v2 * 3.6) * (t2 / 60)
t3 = S / v1
t = t3 - t1
print ("Пешеходу осталось идти ",t,"часов")
#5
a = int (11000)
b = int (25)
c = int (15)
t = a * 4 - (a + (a * 4 * b / 100) + (a * 4 * c / 100))
print ("У Пети осталось", t,"$")
#6
print(((60-(14+16))/5)**(22-19))
#7
a = input ("Введите слова через запятую: ")
print ("Самое большое: ", max (a.split(), key=len))

